Revit 2027 API
ParameterTypeId.ViewScaleMetric Property
 "Scale:"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewScaleMetric { get; }
Public Shared ReadOnly Property ViewScaleMetric As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewScaleMetric {
	ForgeTypeId^ get ();
}
static member ViewScaleMetric : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace